---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsAttrRiserTreadConnect
source: html/6057e78c-294e-300d-5f3c-cb369b9ea26e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsAttrRiserTreadConnect Property

"Riser to Tread Connection"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsAttrRiserTreadConnect { get; }
```